app/controllers/public/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def checks
        @customer = Customer.find_by(id: current_customer)