app/controllers/public/homes_controller.rb

SELECT "items".* FROM "items"
---
    def top
        @items = Item.page(params[:page]).per(6)