app/controllers/public/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        @items = Item.page(params[:page]).per(6)